[{"page_url": "https://www.hdb.gov.sg/residential/buying-a-flat/buying-procedure-for-resale-flats/overview", "page_category": "Overview", "page_section": "Main", "page_char_count": 4858, "page_word_count": 848, "page_sentence_count_raw": 35, "page_token_count": 1214.5, "texts": "Overview Here is an overview of the resale process: Buying a resale flat Log in to My Flat Dashboard on HDB Flat Portal to start your journey. You will be guided through the following steps for the buying process: Step 1 and 2: Obtain an HDB Flat Eligibility (HFE) Letter Apply for an HDB Flat Eligibility (HFE) letter on My Flat Dashboard for a holistic understanding of your housing and financing options before you embark on your home buying journey. The HFE letter will inform you upfront of your eligibility to purchase a new or resale flat, as well as the amounts of CPF housing grants and HDB housing loan you are eligible for. Read our frequently asked questions on the HFE letter. You may request for an In-Principle Approval from the participating financial institutions when you apply for an HFE letter.  Step 3: Search for a suitable flat and obtain an Option to Purchase (OTP) from flat seller After obtaining an HFE letter, you may look for a suitable flat that meets your budget and household needs. Browse resale flat listings on the HDB Flat Portal. Read our guide on finding a flat for more information on the Resale Flat Listing (RFL) service and other resources you can use to help plan and prepare for your flat purchase. You can either manage the purchase on your own or engage the service of a salesperson for a fee. Please read managing the flat purchase and consider signing up for our resale seminars to learn more about resale policies and procedures. Obtain an Option to Purchase (OTP) from the flat seller* after you have agreed on the flat price. * Sellers must have registered an Intent to Sell for more than 7 days. Step 4: Confirm mode of financing If you intend to get an HDB housing loan, you will need a valid HFE letter^ from HDB before flat sellers may grant you an OTP. If you have indicated that you intend to get an HDB housing loan in your HFE application, the loan outcome will be reflected in your HFE letter accordingly. If you have indicated that you intend to get a housing loan from a financial institution in your HFE application, you must have a valid Letter of Offer (LO) before you exercise the OTP. You may concurrently request an In-Principle Approval and LO from participating financial institutions when applying for the HFE letter^ on My Flat Dashboard. ^ Refer to Steps 1 and 2 to determine if you need a valid HFE letter. Step 5: Submit Request for Value If you are paying for the flat purchase with CPF savings and/ or housing loan, submit a Request for Value by the next working day after you get the OTP. This is not required if you are not using your CPF savings and any housing loan to pay for the flat purchase. Step 6: Convert In-Principle Approval (IPA) into a Letter of Offer (LO) If you have requested for an IPA while applying for the HFE letter, you can convert the IPA into an LO at this step, before exercising the OTP during the Option Period. Step 7: Submit resale application After you exercise the OTP, you and the sellers must submit the respective portions of the resale application. Step 8 and 9: Acknowledge resale documents and pay fees Upon receiving a complete resale application and the full set of supporting documents from you and the sellers, we will verify the eligibility of both parties and accept the resale application within 28 working days. We will prepare the necessary documents for you and the sellers to endorse, which will be ready about 3 weeks after the application has been accepted. You and the sellers must acknowledge and endorse the resale documents, and pay the necessary fees. Step 10: Get resale approval After the documents are endorsed and fees paid, HDB will grant an approval for the resale transaction. Step 11: Attend completion appointment Resale completion is about 8 weeks from the date of HDB’s acceptance of the resale application. This is the earliest possible date to complete the transaction. If you wish to defer the completion, please discuss with your sellers and let us have a written confirmation (signed by both sellers and buyers) via MyRequest@HDB. You and the sellers will be notified via SMS of the appointment. You may also log in to My Flat Dashboard for the appointment details.   NEXT STEPS Application for an HDB Flat Eligibility (HFE) Letter Find out more about the HFE letter and how to apply for one to confirm your eligibility. You may also concurrently apply for an In-Principle Approval from the financial institutions for a housing loan. Plan, Source and Contract Find out about the mode of financing, registering an Intent to Buy and entering into an Option To Purchase. Resale Application Learn about submitting a resale application and what to expect after you have submitted one. Resale Completion Obtain details on the resale completion appointment and the actions to take before and during the appointment."}, {"page_url": "https://www.hdb.gov.sg/residential/buying-a-flat/buying-procedure-for-resale-flats/plan-source-and-contract/planning-considerations", "page_category": "Planning Considerations", "page_section": "Main", "page_char_count": 3588, "page_word_count": 607, "page_sentence_count_raw": 25, "page_token_count": 897.0, "texts": "Planning Considerations Start your journey by applying for an HDB Flat Eligibility (HFE) letter via My Flat Dashboard for a holistic understanding of your housing and financing options before you embark on your home buying journey. The HFE letter will inform you upfront of your eligibility to buy a new or resale flat, as well as the amounts of CPF housing grants and HDB housing loan you are eligible for. Read our frequently asked questions on the HFE letter. Read our guides below when planning your resale flat purchase: Finding a flat After obtaining an HFE letter, look for a suitable flat that meets your budget and needs. Browse resale flat listings on the HDB Flat Portal. Read our guide on finding a flat for more information on the Resale Flat Listing (RFL) service and other services you can use to help plan and prepare for your flat purchase. Managing the flat purchase You can either manage the flat purchase on your own or engage the services of a salesperson. If you are managing the flat purchase on your own, read our guide on preparations for the flat purchase, such as considering your budget, searching for a flat and negotiating the price. The guide also includes practical tips on engaging a salesperson, if you decide to do so. If you are engaging a salesperson, check the salesperson’s phone number with CEA's Public Register to verify the identity of the salesperson and ensure that he/ she is a registered salesperson, and safeguard yourself against scammers. Important note: The applicant(s) and occupier(s) listed in your resale flat application must remain the same as those in your HFE letter application. If you need to make any changes to your HFE letter, e.g. addition/ removal of household member(s), change in status from an applicant to an occupier or vice versa, marital status, citizenship, ownership of private properties, etc., please follow the steps below: Submitted a resale application Steps to take No Cancel your HFE letter After cancellation, apply for a fresh HFE letter (i.e. complete Step 1 and Step 2 of the buying process again) via My Flat Dashboard Yes Write to us via MyRequest@HDB with your resale case number. We will advise you further. Mode of financing To work out a financial plan for your flat purchase, you need to consider the following: Payments that you will make by using cash and CPF savings The amount of housing loan CPF housing grant(s) Read mode of financing, where we provide a breakdown of the payments required, and the types of housing loans available and financial tools you can use. Ethnic Integration Policy (EIP) and/ or Singapore Permanent Resident (SPR) quota When buying a resale flat, you must ensure your household is within the EIP quota for the block and neighbourhood, and if applicable, the SPR quota as well. Find out about the EIP and SPR quota and how to check your eligibility. The prevailing EIP and SPR quotas for the month are also displayed on the resale flat listings on the HDB Flat Portal. Conversion of Adjoining Flats Scheme Read about the Conversion of Adjoining Flats Scheme if you and your family intend to buy adjoining 3-room or smaller flats.   NEXT STEPS Mode of Financing Learn about the financial considerations for buying an HDB resale flat. There are also several tools and resources for your use. Option to Purchase Read about entering into an Option to Purchase (OTP) with flat sellers. Request for Value Obtain information on submitting a request for value. Resale Application Learn about submitting a resale application and what to expect after you have submitted one."}, {"page_url": "https://www.hdb.gov.sg/residential/buying-a-flat/buying-procedure-for-resale-flats/plan-source-and-contract/planning-considerations/managing-the-flat-purchase", "page_category": "Managing the Flat Purchase", "page_section": "Main", "page_char_count": 2539, "page_word_count": 413, "page_sentence_count_raw": 17, "page_token_count": 634.75, "texts": "Managing the Flat Purchase You can either manage the flat purchase on your own or engage the services of a salesperson for a fee. Manage the purchase on your own The following guide will prepare you for the flat purchase. Check your eligibility to buy a resale flat You must have a valid HDB Flat Eligibility (HFE) letter before you can obtain an Option to Purchase (OTP) from a flat seller. Consider your budget Plan your finances and work out your budget before you search for a suitable flat. Search for a flat Search for a resale flat using HDB’s Resale Flat Listing (RFL) service or through other reputable platforms. Attend flat viewings When you attend a flat viewing appointment, these are some considerations to keep in mind. Negotiate the price Price negotiation is not simply about offering the lowest price and haggling with flat sellers. Here are some useful tips. Understand the HDB resale procedures Engage a salesperson You may engage a salesperson for a fee to help you manage the flat purchase. Nevertheless, you still need to know your eligibility to buy a resale flat and the financing of the flat purchase. You may read the information in ‘Manage the purchase on your own’, and also: Read the Council for Estate Agents (CEA)'s Consumer Guide and educational materials for practical tips when engaging the services of a salesperson Check the salesperson’s phone number with CEA's Public Register to verify his/her identity and ensure he/she is a registered salesperson, and safeguard yourself against scammers. Consider using the CEA’s Prescribed Estate Agency Agreement when engaging the salesperson’s services Ensure that you discuss with the salesperson and mutually agree on: The terms of service The commission payable The period of representation Any exclusivity (if agreed upon) Any other terms, such as payment for advertising Engaging a salesperson is a private matter between you and the salesperson. If you have any issues relating to estate agents or their salespersons, please seek clarification from CEA.   NEXT STEPS Plan, Source and Contract Find out about the mode of financing, registering an Intent to Buy and entering into an Option To Purchase. Resale Application Learn about submitting a resale application and what to expect after you have submitted one. Resale Completion Obtain details on the resale completion appointment and the actions to take before and during the appointment. Conditions After Buying Learn about the conditions that flat buyers have to follow after moving into their flat."}, {"page_url": "https://www.hdb.gov.sg/residential/buying-a-flat/buying-procedure-for-resale-flats/plan-source-and-contract/planning-considerations/managing-the-flat-purchase", "page_category": "Managing the Flat Purchase", "page_section": "Accordion", "page_char_count": 941, "page_word_count": 166, "page_sentence_count_raw": 6, "page_token_count": 235.25, "texts": "Check your eligibility to buy a resale flat You must have a valid HDB Flat Eligibility (HFE) letter before you can obtain an Option to Purchase (OTP) from a flat seller. Start your journey by applying for an HDB Flat Eligibility (HFE) letter via My Flat Dashboard for a holistic understanding of your housing and financing options before you embark on your home buying journey. The HFE letter will inform you upfront of your eligibility to purchase a new or resale flat, as well as the amounts of CPF housing grants and HDB housing loan you are eligible for. Read our frequently asked questions on the HFE letter. If you intend to get a housing loan from a financial institution, you must have a valid Letter of Offer (LO) before you exercise the OTP. You may request for an In-Principle Approval (IPA) from the participating financial institutions when you apply for an HFE letter and request to convert the IPA to LO via My Flat Dashboard."}, {"page_url": "https://www.hdb.gov.sg/residential/buying-a-flat/buying-procedure-for-resale-flats/plan-source-and-contract/planning-considerations/managing-the-flat-purchase", "page_category": "Managing the Flat Purchase", "page_section": "Accordion", "page_char_count": 776, "page_word_count": 135, "page_sentence_count_raw": 5, "page_token_count": 194.0, "texts": "Consider your budget Plan your finances and work out your budget before you search for a suitable flat. You may use a combination of cash, savings in your CPF Ordinary Account, and a housing loan from HDB or a financial institution (FI) regulated by the Monetary Authority of Singapore to buy a flat. To plan for your flat purchase, you may use the budget calculator to estimate your budget and compare the information on housing loans offered by HDB and our participating FIs. Learn more about the mode of financing for your flat, where we provide a breakdown of the payments required, and the types of housing loans available and financial tools you can use. Make sure you set aside some cash savings for renovation and other necessary expenses to settle into your new home."}, {"page_url": "https://www.hdb.gov.sg/residential/buying-a-flat/buying-procedure-for-resale-flats/plan-source-and-contract/planning-considerations/managing-the-flat-purchase", "page_category": "Managing the Flat Purchase", "page_section": "Accordion", "page_char_count": 1421, "page_word_count": 250, "page_sentence_count_raw": 11, "page_token_count": 355.25, "texts": "Search for a flat Search for a resale flat using HDB’s Resale Flat Listing (RFL) service or through other reputable platforms. After you have obtained an HFE letter (as well as an In-principle Approval letter for a housing loan from the financial institutions, if applicable) and worked out your budget, you may browse resale flat listings on the HDB Flat Portal. Read our guide on finding a flat for more information on the Resale Flat Listing (RFL) service and other resources you can use to help you plan and prepare for your flat purchase. You may also refer to property portals, newspaper advertisements or social media section in your search for a flat. Your budget Your housing needs, e.g. to live near parents’ or child’s home, place of work, schools, etc. Your ethnic group to buy a flat in the block, or your nationality if you are a Singapore Permanent Resident (SPR) household. Learn more about the Ethnic Integration Policy (EIP) and SPR quota Remaining lease of the flat* You may be approached by salespersons offering to act for you. If you are handling the purchase on your own, please tell them so. * CPF usage and HDB housing loan limits will depend on the extent the remaining lease can cover the youngest buyer to the age of 95. You can check the maximum amount of CPF savings and loan that can be used for housing by using CPF Board's e-service and HDB housing loan using our payment plan calculator."}, {"page_url": "https://www.hdb.gov.sg/residential/buying-a-flat/buying-procedure-for-resale-flats/plan-source-and-contract/planning-considerations/managing-the-flat-purchase", "page_category": "Managing the Flat Purchase", "page_section": "Accordion", "page_char_count": 1536, "page_word_count": 264, "page_sentence_count_raw": 13, "page_token_count": 384.0, "texts": "Attend flat viewings When you attend a flat viewing appointment, these are some considerations to keep in mind. If you have a valid HFE letter, you may arrange flat viewing appointments with flat sellers or their appointed salesperson(s) in the resale flat listings on the HDB Flat Portal. Refer to our user guide and instructional video for more details on how to do so. You may arrange for viewings at different times of the day and week to better gauge if a flat is suitable for you. During a viewing, do consider the following: Condition of the flat, e.g. renovation and upkeep Spalling concrete, cracks, or leakages on ceiling or wall Flat orientation, e.g. north, south, east, or west Any tenants in the flat and whether they can move out by the resale completion date Signs of moneylending activities from, e.g. loan-sharks If the flat is on a lift-landing floor Any upgrading programmes announced for the flat, and if the upgrading cost has been paid Issues which you may be concerned with, e.g. past incidents which may have happened in the flat, neighbours, environment, etc. If you have any doubts, clarify with the flat sellers or their salesperson. Take note of the answers and observe their reactions. Proof of flat ownership Request the flat sellers to show proof that they own the flat and are eligible to sell it. Documents such as a printout from the flat sellers’ My HDBPage at HDB InfoWEB, property tax statement, town council statement, or title deed are examples of documents that can confirm the owners of a flat."}, {"page_url": "https://www.hdb.gov.sg/residential/buying-a-flat/buying-procedure-for-resale-flats/plan-source-and-contract/planning-considerations/managing-the-flat-purchase", "page_category": "Managing the Flat Purchase", "page_section": "Accordion", "page_char_count": 3215, "page_word_count": 559, "page_sentence_count_raw": 22, "page_token_count": 803.75, "texts": "Negotiate the price Price negotiation is not simply about offering the lowest price and haggling with flat sellers. Here are some useful tips. Prepare yourself Be mindful of your budget, which you must consider before starting your search for a flat. Make a reasonable offer, based on your budget and your perceived value of the flat. Arm yourself with information and alternatives You are in a better position to negotiate when you have: More information about the flat, such as the flat type, remaining lease, and recent transacted prices of similar flats nearby Found other flats which you are open to consider buying Time and timing Do not rush into your flat purchase. Give yourself time to look around and assess your choices. When you see a flat that suits your budget and needs, take your time to inspect the flat and its condition before deciding on the purchase. Other matters Other than the flat price, there are other matters you must consider when you negotiate with the flat sellers: Deposit comprising Option Fee and Option Exercise Fee You must pay flat sellers an Option Fee when they grant you an Option to Purchase (OTP), and an Option Exercise Fee when you exercise the OTP. You may negotiate the amounts of Option Fee and Option Exercise Fee with the flat sellers, which will form part of the resale price. Payment by flat buyers to sellers Stage of OTP Amount to pay Option Fee Granting of OTP Between $1 and $1,000 Option Exercise Fee Exercising of OTP An amount, which when including the Option Fee, will not exceed $5,000 You are encouraged to make payment using digital payment modes to secure independent proof of payment. Submission of resale application Under Clause 12 of the OTP, you and the sellers must agree on the timeframe to submit the resale application to HDB. This is a contractual term between you and the sellers. Once it is agreed upon, it may be varied only with mutual consent. Please submit the resale application as soon as possible to minimise unforeseeable changes, e.g. EIP and SPR quotas, untoward events, etc. Extension of stay To ease sellers’ transition to their next home, sellers may arrange with you to extend their stay temporarily in the flat, for up to 3 months after the resale completion. The temporary extension of stay is subject to your agreement. If you agree, the minimum occupation period that you have to fulfil after the flat purchase will start only when the sellers have moved out of your flat. Enhanced Contra Facility If you are planning to sell your existing HDB flat and buy another resale HDB flat, you may consider applying for the Enhanced Contra Facility (ECF). This facility allows you to use the cash proceeds and refunded CPF savings from the flat sale and complete the purchase of your next flat at the same time. Take note that if you are applying for the ECF when buying your next flat, the buyers of your existing flat and the flat sellers of your intended resale flat purchase will not be able to apply for ECF for their respective flat purchases. Any other matters For example, will the sellers leave behind any furniture or appliances? They may offer these items to you and include the items in the inventory list of the OTP."}, {"page_url": "https://www.hdb.gov.sg/residential/buying-a-flat/buying-procedure-for-resale-flats/plan-source-and-contract/planning-considerations/managing-the-flat-purchase", "page_category": "Managing the Flat Purchase", "page_section": "Accordion", "page_char_count": 342, "page_word_count": 54, "page_sentence_count_raw": 2, "page_token_count": 85.5, "texts": "Understand the HDB resale procedures My Flat Dashboard provides a step-by-step guide on your buying journey. You may also read the following for more details of the resale procedures: Plan, Source and Contract Resale Application Resale Completion To better understand the resale process, you may sign up for a resale seminar conducted by HDB."}, {"page_url": "https://www.hdb.gov.sg/residential/buying-a-flat/buying-procedure-for-resale-flats/plan-source-and-contract/planning-considerations/eip-spr-quota", "page_category": "Ethnic Integration Policy (EIP) and Singapore Permanent Resident (SPR) Quota", "page_section": "Main", "page_char_count": 2540, "page_word_count": 430, "page_sentence_count_raw": 18, "page_token_count": 635.0, "texts": "Ethnic Integration Policy (EIP) and Singapore Permanent Resident (SPR) Quota When buying an HDB resale flat, you must ensure your household is within the EIP quota for the block and neighbourhood, and if applicable, the SPR quota as well. How the EIP and SPR quota work The EIP quota applies for the purchase of an HDB flat. In addition, non-Malaysian SPR households must meet the SPR quota. You may be eligible to buy a flat if: You and the flat seller are of the same ethnic group and household citizenship; or After your flat purchase, the number of households of your ethnic group remains within the block and neighbourhood limits. In addition, for non-Malaysian SPR households, the number of SPR households remains within the SPR quota. Check your eligibility You may use our e-Service to check if you are eligible to buy an HDB resale flat in a particular block or neighbourhood under the EIP/ SPR quota. The prevailing EIP and SPR quotas for the month are also displayed on the resale flat listings on the HDB Flat Portal. The quotas are updated on the 1st of each month. Please check to ensure compliance with the EIP/ SPR quota at each of the following milestones: Flat sellers grant the Option to Purchase (OTP); You exercise the OTP; and You and the flat sellers submit the respective portion of the resale application. * A resale application is completed only when HDB receives both the buyers’ and sellers’ portions of the resale application and the necessary supporting documents. About the EIP The EIP is put in place to preserve Singapore’s multi-cultural identity and promote racial integration and harmony. It ensures that there is a balanced mix of the various ethnic communities in HDB towns. The EIP limits are set at block and neighbourhood levels based on the ethnic make-up of Singapore. For the purchase of an HDB flat, a household with members of different ethnic groups may choose to classify their household ethnicity under the ethnicity of any buyer(s) or spouse according to the race shown on their NRIC. Once an ethnicity is chosen for the household, it will remain the same when the flat owners subsequently sell their flat on the open market. About the SPR quota The SPR quota ensures that SPR families can better integrate into the local community. Malaysians are excluded from this quota because of their close cultural and historical similarities with Singaporeans. Non-Malaysian SPR households applying to buy an HDB resale flat need to be within the SPR quota for the block (8%) and neighbourhood (5%)."}, {"page_url": "https://www.hdb.gov.sg/residential/buying-a-flat/buying-procedure-for-resale-flats/plan-source-and-contract/mode-of-financing", "page_category": "Mode of Financing", "page_section": "Main", "page_char_count": 1178, "page_word_count": 205, "page_sentence_count_raw": 10, "page_token_count": 294.5, "texts": "Mode of Financing Plan your finances and work out your budget before you search for a suitable home. To work out a financial plan, consider the following: Payments that you need to make by using cash and CPF savings The amount of housing loan CPF housing grant(s) You can use our calculators to estimate your finances and the amount of housing loan you may need for your flat purchase. Read working out your flat budget for more tips on financing a flat purchase. Cash and CPF savings There are payments that you need to make at various stages of the flat purchase. Do ensure that you have sufficient funds for all the payments. Housing loan To finance your flat purchase, you may choose to take a housing loan from HDB or a financial institution (FI) regulated by the Monetary Authority of Singapore. CPF housing grants You may be eligible to receive a housing subsidy to help with the purchase of your resale flat.   NEXT STEPS Option to Purchase Read about granting an Option to Purchase to your buyers. Request for Value Obtain information on submitting a request for value. Application Learn about the details and documents required when buyers submit a resale application."}, {"page_url": "https://www.hdb.gov.sg/residential/buying-a-flat/buying-procedure-for-resale-flats/plan-source-and-contract/mode-of-financing", "page_category": "Mode of Financing", "page_section": "Accordion", "page_char_count": 4636, "page_word_count": 831, "page_sentence_count_raw": 30, "page_token_count": 1159.0, "texts": "Cash and CPF savings There are payments that you need to make at various stages of the flat purchase. Do ensure that you have sufficient funds for all the payments. Cash You must use cash at the following stages: Option to Purchase Deposit to seller for Option to Purchase (OTP) You must pay the sellers a deposit ($2 to $5,000), which consists of the Option Fee and Option Exercise Fee, during the granting and exercising of the Option to Purchase respectively. Processing fee for Request for Value If you intend to buy a resale flat using your CPF savings and/ or a housing loan, make a Request for Value to HDB to determine the flat’s value. You will need to pay a processing fee of $120. Resale Application Resale application fee You must pay an administrative fee of $80 (or $40 for 1- and 2-room flats), when you submit your portion of the resale application via My Flat Dashboard. Legal fees The amount payable will depend on the solicitor you appoint to act for you. Read more about the payments required. Part of the initial payment You must pay part of the initial payment in cash if you are taking a housing loan from a financial institution (FI) or have insufficient CPF savings. Others E.g. the administrative fee if you agree to the temporary extension of stay by flat sellers Resale Completion Amount not covered by CPF savings and eligible housing loan amount You must pay the balance purchase price of the flat before or during the resale completion appointment, after factoring in: Initial payment Any CPF housing grant(s) CPF Ordinary Account savings Eligible housing loan amount Read more about the resale completion appointment. Cash proceeds from disposal of the last flat if you are taking a second HDB housing loan If you are taking a second HDB housing loan, you have to use part of the cash proceeds from the disposal of an existing or previous flat to pay for your flat purchase, so as to reduce the loan amount required, for financial prudence. Others E.g.: Fire insurance Home Protection Insurance premium Other expenses such as furnishings, renovation CPF savings The savings in your CPF Ordinary Account (OA) can be used for: Legal fees The legal fees will depend on the solicitor you appoint to act for you. Initial payment You may use your CPF savings to pay for the initial payment. If you are taking a housing loan from a financial institution (FI), at least 5% of the initial payment have to be in cash. Balance purchase price You may use your CPF savings to pay for the balance purchase price. Monthly payments of mortgage instalments The monthly payments will start after the resale completion. Flat buyers taking a housing loan from HDB have the option of retaining up to $20,000 of the available CPF savings in each buyer's OA. The remaining balance in the CPF OA must be used to pay for the flat purchase, before they can take an HDB housing loan. If you need the CPF refund from the sale of your current property to finance the resale flat purchase, please ensure the amount has already been credited to your CPF OA, before you submit the resale application. You should also take note of the following conditions for using your CPF savings: There is a limit on the total amount of CPF savings that can be used for your flat purchase. Once that limit is reached, you will not be able to withdraw more of your CPF savings and have to pay the balance flat purchase price and/ or monthly mortgage instalments in cash The total amount of CPF savings that can be used for your flat purchase and/ or paying monthly mortgage instalments will depend on the extent the remaining lease of the flat can cover the youngest buyer up to the age of 95. You can get the details of a flat's lease at HDB Map Services. Details on the use of CPF savings and the applicable limits are shown in the table below: Remaining lease of flat is at least 20 years and can cover the youngest buyer up to the age of 95 Applicable Limits for CPF Usage Yes The amount use is capped at the lower of the value of flat or price of the flat at the time of purchase. No The amount is pro-rated based on the extent the remaining lease of the flat can cover the youngest buyer up to the age of 95. When the allowed CPF amount is used up, buyers have to pay the balance flat purchase price and/ or monthly mortgage instalments in cash. This will help buyers to set aside CPF savings for their housing needs during retirement (e.g. buying a replacement property). For information on the use of CPF savings, you may use the CPF Board's online calculator. For further enquiries on the use of CPF savings, please visit CPF Board’s website."}, {"page_url": "https://www.hdb.gov.sg/residential/buying-a-flat/buying-procedure-for-resale-flats/plan-source-and-contract/mode-of-financing", "page_category": "Mode of Financing", "page_section": "Accordion", "page_char_count": 4377, "page_word_count": 767, "page_sentence_count_raw": 28, "page_token_count": 1094.25, "texts": "Housing loan To finance your flat purchase, you may choose to take a housing loan from HDB or a financial institution (FI) regulated by the Monetary Authority of Singapore. Buying a flat is a long-term commitment, and mortgage payments can stretch up to 25 years or more. Hence, it is important to exercise financial prudence so that you can sustain the monthly payments. Housing loan from HDB Before buying a flat and taking housing loan from HDB, you need to first obtain an HDB Flat Eligibility (HFE) letter. The HFE letter will provide you with a holistic understanding of your housing and financing options before you embark on your home buying journey. It will inform you upfront of your eligibility to purchase a new or resale flat, as well as the amount of CPF housing grants and HDB housing loan you are eligible for. Do take note of the following: Valid HFE letter You will need a valid HFE letter at all of the following stages: Before obtaining an Option to Purchase (OTP) from a flat seller When you exercise the OTP When you submit the resale application Household status Your household’s eligibility for housing subsidies and HDB housing loan is assessed based on the core family nucleus in your HFE letter application, which is formed by the core member(s). Core members refer to the  applicant(s) and occupier(s) in an HFE letter application who enable the applicant(s) to qualify for a flat purchase under an eligibility scheme. All core members must remain in the flat application, and physically occupy the flat during the minimum occupation period (MOP) after the flat purchase. Their names cannot be removed. You and all core members must not have taken 2 or more housing loans from HDB. Second HDB housing loan The eligible loan amount will be granted only you have paid for the flat purchase with the CPF refund and up to 50% of the cash proceeds from the disposal of your current or last owned flat/ property. Retaining up to $20,000 CPF savings in the Ordinary Account (OA) You and your co-applicant(s) may each retain up to $20,000 CPF savings in the Ordinary Account (OA). The rest of the available CPF OA balances must be used to pay for the flat purchase. Remaining lease of flat If the lease can cover the youngest core member up to the age of 95 and above, the Loan-to-Value (LTV) limit will be 75%^ of the lower of the resale price and value Otherwise, the LTV limit will be pro-rated from 75%^. You may use the following online calculators to compute the allowable CPF usage and HDB housing loan: CPF usage HDB housing loan for a resale flat You can get the details of a flat’s lease using the HDB Map Services. If you have submitted a resale application, you will be provided with a customised financial plan, which will include the applicable LTV limit at point of resale application (if you are taking an HDB housing loan), and the payments required at the various milestones of your flat purchase. ^ For complete resale applications received by HDB on or after 20 August 2024. Refinancing to housing loan from financial institution (FI) You may refinance the HDB housing loan for your flat with a housing loan from an FI. If you are not eligible for a housing loan from HDB but need financing for your flat purchase, please obtain a loan from an FI. Housing loan from financial institutions You may choose to finance your flat purchase with a housing loan from the FIs regulated by Monetary Authority of Singapore (MAS). View and compare the housing loan packages offered by the participating FIs on My Flat Dashboard. Check the key terms and considerations in taking up a housing loan from the FIs before deciding. You can use our calculator to obtain housing loan estimates from the FIs. When applying for an HFE letter on the My Flat Dashboard, you may also apply for an In-Principle Approval (IPA) from the participating FIs, which will provide you with a preliminary assessment of your housing loan eligibility. Before you exercise an Option to Purchase, you may request to convert your IPA into a Letter of Offer via the HDB Flat Portal. Do take note of the following: Valid Letter of Offer (LO) You must have a valid LO before exercising the OTP. Refinancing to housing loan from financial institution (FI) When you take a housing loan from an FI, you may refinance it a housing loan from the same or different FI, but not from HDB."}, {"page_url": "https://www.hdb.gov.sg/residential/buying-a-flat/buying-procedure-for-resale-flats/plan-source-and-contract/mode-of-financing", "page_category": "Mode of Financing", "page_section": "Accordion", "page_char_count": 399, "page_word_count": 68, "page_sentence_count_raw": 3, "page_token_count": 99.75, "texts": "CPF housing grants You may be eligible to receive a housing subsidy to help with the purchase of your resale flat. Read our eligibility conditions to find out if you are eligible for any CPF housing grants, which are housing subsidies given by the Government to eligible Singapore Citizen buyers. The housing grants can be used for the initial payment and to reduce the required housing loan amount."}, {"page_url": "https://www.hdb.gov.sg/residential/buying-a-flat/buying-procedure-for-resale-flats/plan-source-and-contract/option-to-purchase", "page_category": "Option to Purchase", "page_section": "Main", "page_char_count": 3213, "page_word_count": 569, "page_sentence_count_raw": 25, "page_token_count": 803.25, "texts": "Option to Purchase After you have obtained a valid HDB Flat Eligibility (HFE) letter, considered your mode of financing and worked out your budget, you may proceed to look for a suitable flat that meets your budget. Once you have decided on a flat and agreed on a price for it, you may proceed to obtain an Option to Purchase (OTP) from the flat sellers. If you intend to get an HDB housing loan, you must have a valid HFE letter from HDB before the flat sellers may grant you an OTP. If you intend to get a housing loan from a financial institution, you must have a valid Letter of Offer (LO) before you exercise the OTP. You may concurrently request an In-Principle Approval and LO from participating financial institutions when applying for the HFE letter through My Flat Dashboard. You and the flat sellers must use the HDB-prescribed OTP for the resale transaction. Any other agreements and/ or supplementary agreements relating to the sale or purchase of the flat are not valid under the Housing and Development Act. Print only 1 copy of the OTP as each form has a unique serial number. You must state the serial number of the OTP when you submit a resale application to HDB. The OTP is a legally binding contract between you and the flat sellers. Read the Important Notes of the OTP and the Terms and Conditions of Resale carefully before entering into a contract. Deposit to sellers You must pay flat sellers an Option Fee when they grant you an OTP, and an Option Exercise Fee when you exercise the OTP. You may negotiate the amounts of Option Fee and Option Exercise Fee with the flat sellers, which will form part of the resale price. Payment by flat buyers to sellers Stage of OTP Amount to pay Option Fee Granting of OTP Between $1 and $1,000 Option Exercise Fee Exercising of OTP An amount, which when including the Option Fee, will not exceed $5,000 You are encouraged to make payment using digital payment modes to secure independent proof of payment. Procedure to enter into a contract using the OTP Read the steps below for more details. Step 1: Negotiate and agree on the resale price You and the flat sellers must mutually agree on the resale price of the flat. Step 2: Sellers grant the OTP to you The flat sellers will grant you the OTP to buy the resale flat at the agreed resale price. Step 3: Review purchase during Option Period The OTP is valid for 21 calendar days from the date the OTP is granted. Step 4: Exercise the OTP or allow OTP to expire To proceed with the flat purchase, you must exercise the OTP within the Option Period. Otherwise, you must wait for the OTP to expire. Step 5: Submit the resale application After you have exercised the OTP, you and the sellers must decide when to submit the respective portions of the resale application to HDB.   NEXT STEPS Request for Value Obtain information on submitting a request for value. Application Learn about the details and documents required when buyers submit a resale application. Resale Completion Obtain details on the resale completion appointment and the actions to take before and during the appointment. Conditions After Buying Learn about the conditions that flat buyers have to follow after moving into their flat."}, {"page_url": "https://www.hdb.gov.sg/residential/buying-a-flat/buying-procedure-for-resale-flats/plan-source-and-contract/option-to-purchase", "page_category": "Option to Purchase", "page_section": "Accordion", "page_char_count": 959, "page_word_count": 167, "page_sentence_count_raw": 6, "page_token_count": 239.75, "texts": "Step 1: Negotiate and agree on the resale price You and the flat sellers must mutually agree on the resale price of the flat. You may use the resale flat prices e-service to check the transacted resale flat prices to help you make an informed decision on how much to pay for the flat. The figures are updated daily based on HDB’s registration of the resale applications received. Before entering into an OTP Ensure that you have obtained a valid HDB Flat Eligibility (HFE) letter via My Flat Dashboard. When entering the OTP You and the flat sellers must declare the true resale price of the flat to HDB, and must not enter into any supplementary/ other agreements or arrangements that may cause the resale price as declared to be inflated or understated. Note: It is an offence to give false information relating to the resale application - HDB may take the necessary action(s) as stated in the Terms & Conditions, Option to Purchase and Application Form(s)."}, {"page_url": "https://www.hdb.gov.sg/residential/buying-a-flat/buying-procedure-for-resale-flats/plan-source-and-contract/option-to-purchase", "page_category": "Option to Purchase", "page_section": "Accordion", "page_char_count": 1536, "page_word_count": 285, "page_sentence_count_raw": 6, "page_token_count": 384.0, "texts": "Step 2: Sellers grant the OTP to you The flat sellers will grant you the OTP to buy the resale flat at the agreed resale price. Completing the OTP The flat sellers must fill in these sections in the OTP: Page Sections 1 Option Date Flat address Purchase price (resale price of the flat) Option Fee (between $1 to $1,000) Option expiry date (21 calendar days from the option day, including Saturdays, Sundays and Public Holidays. For e.g., if the flat sellers grant an Option to you on 1 April, the Option will expire on 22 April at 4pm) Names (as in NRIC) and NRIC numbers of all the flat sellers and buyers 2 Clause 6.1(c): Option Exercise Fee 4 Clause 12: Number of days from the date of exercising the Option that you and the flat sellers have agreed to submit the resale application to HDB 8 (top half) Option Date Flat address All flat sellers must sign on the OTP A witness may sign on the OTP (seller's salesperson or any person, aged 21 years or above, and not involved in the resale transaction) 9 (optional) Inventory list of the flat 10 (optional) Authorisation for another person to receive the Acceptance of the flat buyers when they exercise the OTP Option Fee At this stage, you do not have to sign on the OTP. However, you must pay an Option Fee to the flat sellers. The Option Fee should be a sum between $1 and $1,000, to be mutually agreed between you and the flat sellers. Once the flat sellers have granted the OTP to you, they cannot grant another OTP to other flat buyers until the OTP granted to you has expired."}, {"page_url": "https://www.hdb.gov.sg/residential/buying-a-flat/buying-procedure-for-resale-flats/plan-source-and-contract/option-to-purchase", "page_category": "Option to Purchase", "page_section": "Accordion", "page_char_count": 965, "page_word_count": 180, "page_sentence_count_raw": 8, "page_token_count": 241.25, "texts": "Step 3: Review purchase during Option Period The OTP is valid for 21 calendar days from the date the OTP is granted. The Option Period is 21 calendar days (including Saturdays, Sundays, and Public Holidays). It is given to you by the flat sellers, from the date of granting the OTP (refer to Step 2).  You should use the Option Period wisely and not rush into exercising the OTP. During this period, you must log in to My Flat Dashboard to: Confirm mode of financing Confirm your mode of financing (i.e., cash, CPF savings, and/ or a housing loan) for your flat purchase in My Flat Dashboard. Request for Value of Flat You must submit a Request for Value for the flat if you are using your CPF savings and/ or taking up a housing loan to finance your flat purchase. You may submit the request via My Flat Dashboard after the flat sellers have granted you the OTP. Once you have made the request, you can log in to My Flat Dashboard to view the progress and outcome."}, {"page_url": "https://www.hdb.gov.sg/residential/buying-a-flat/buying-procedure-for-resale-flats/plan-source-and-contract/option-to-purchase", "page_category": "Option to Purchase", "page_section": "Accordion", "page_char_count": 1799, "page_word_count": 331, "page_sentence_count_raw": 13, "page_token_count": 449.75, "texts": "Step 4: Exercise the OTP or allow OTP to expire To proceed with the flat purchase, you must exercise the OTP within the Option Period. Otherwise, you must wait for the OTP to expire. Proceed with flat purchase: Exercise the OTP To proceed with the flat purchase, you must exercise the OTP during the Option Period. If you are taking a housing loan or using your CPF savings to pay for the flat, ensure that the flat value* is available before you exercise the OTP. * Read request for value for more information. Housing loan from HDB If you are taking a housing loan from HDB, ensure that you have a valid HDB Flat Eligibility (HFE) letter. Housing loan from a financial institution (FI) If you are taking a housing loan from a FI, ensure that you have a valid Letter of Offer (LO). The date of issue of the LO must be on or before you exercise the OTP. You may concurrently request an In-Principle Approval and LO from participating financial institutions when applying for the HFE letter^ on My Flat Dashboard. Signing and returning the OTP To exercise the Option, you must sign on the OTP and return it to the flat sellers: Page Sections 8 (bottom half) You and all your co-buyers must sign on the “ACCEPTANCE” section A witness may sign on the OTP (your salesperson or any person, aged 21 years or above, and not involved in the resale transaction) Option Exercise Fee When you exercise the OTP, you need to pay an Option Exercise Fee to the flat sellers. The amount, as stated in Step 2, is to be mutually agreed upon between you and the flat sellers. Not proceeding with flat purchase: Allow OTP to expire If you do not wish to proceed with the purchase, you need not take any further action. Upon expiry of the OTP, you will forfeit the Option Fee and you do not need to continue with Step 5."}, {"page_url": "https://www.hdb.gov.sg/residential/buying-a-flat/buying-procedure-for-resale-flats/plan-source-and-contract/option-to-purchase", "page_category": "Option to Purchase", "page_section": "Accordion", "page_char_count": 1415, "page_word_count": 234, "page_sentence_count_raw": 8, "page_token_count": 353.75, "texts": "Step 5: Submit the resale application After you have exercised the OTP, you and the sellers must decide when to submit the respective portions of the resale application to HDB. You and the flat sellers must both submit the respective portions of the resale application separately within both timeframes: Within the agreed number of days as stated on page 4 of the OTP, and Within 7 days of each other’s submission A resale application is only complete when HDB has received both you and the flat sellers' respective portions of the resale application and the necessary supporting documents. Read about submitting a resale application and what you need to do before the application is accepted and approved. Important note: The applicant(s) and occupier(s) listed in your resale flat application must remain the same as those in your HFE letter application. If you need to make any changes to your HFE letter, e.g. addition/ removal of household member(s), change in status from an applicant to an occupier or vice versa, marital status, citizenship, ownership of private properties, etc., please follow the steps below: Submitted a resale application Steps to take No Cancel your HFE letter After cancellation, apply for a fresh HFE letter (i.e. complete Step 1 and Step 2 of the buying process again) via My Flat Dashboard Yes Write to us via MyRequest@HDB with your resale case number. We will advise you further."}, {"page_url": "https://www.hdb.gov.sg/residential/buying-a-flat/buying-procedure-for-resale-flats/plan-source-and-contract/request-for-value", "page_category": "Request for Value", "page_section": "Main", "page_char_count": 2589, "page_word_count": 449, "page_sentence_count_raw": 16, "page_token_count": 647.25, "texts": "Request for Value After the sellers have granted you an Option to Purchase (OTP), the Option Period will commence from the Option Date, i.e., the date of granting the OTP. The Option Period is 21 calendar days (including Saturdays, Sundays, and Public Holidays). During this period, you must: Log in to My Flat Dashboard to confirm your mode of financing, and make a Request for Value After the outcome of the Request for Value is available, confirm your decision whether to buy the flat The Request for Value will determine the flat’s value and form the basis for your CPF usage and/ or the reference for the housing loan amount from HDB or the financial institution (FI), unless otherwise advised by the FI. If you are using cash only (i.e., no CPF usage and no housing loan) to pay for your flat purchase, you do not need to submit a Request for Value. Submit your Request for Value You must submit the Request for Value via My Flat Dashboard by the next working day after the Option Date, together with a scanned copy of Page 1 of the OTP. You have to pay a processing fee of $120 (including GST) to HDB. If you have engaged the services of a salesperson, your salesperson may make the Request for Value on your behalf via e-Resale or Estate Agent Toolkit (for agencies which are subscribers). If a valuation of the flat is required, the appointed valuer will contact the flat seller to arrange for a flat inspection. You will be informed, via email, once the outcome of your Request for Value is available in My Flat Dashboard. The outcome is typically available within 10 working days from the date of your request. Important note: The outcome of the Request for Value is valid for 3 months, from the day it is made available in My Flat Dashboard. You and the flat sellers must submit the respective portions of the resale application* during this 3-month period. Otherwise, you will have to submit a new Request for Value for the same transaction * A resale application is considered complete only when HDB receives both buyers’ and sellers’ portions of resale application and the necessary supporting documents. You have to wait for the outcome of the Request for Value before you may exercise the OTP during the Option Period   NEXT STEPS Application Learn about the details and documents required when buyers submit a resale application. Resale Completion Obtain details on the resale completion appointment and the actions to take before and during the appointment. Conditions After Buying Learn about the conditions that flat buyers have to follow after moving into their flat."}]